Revit 2026 API

# WireSizeSetErase Method

---

Removes a specified wire size from the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	WireSize item
)
```
```vb
Public Overridable Function Erase (
	item As WireSize
) As Integer
```
```cpp
public:
virtual int Erase(
	WireSize^ item
)
```
```fsharp
abstract Erase :
        item : WireSize -> int
override Erase :
        item : WireSize -> int
```

#### Parameters

item WireSize
    The wire size to be erased.

#### Return Value

Int32The number of wire sizes that were erased from the set.

#### Reference

WireSizeSet Class

Autodesk.Revit.DB.Electrical Namespace